# Pandas and SQL

In [25]:
import mysql.connector as sql
import pandas as pd

db_connection = sql.connect(host='localhost', database='bootup',user='root', password='12345')

In [26]:
df = pd.read_sql("SELECT * FROM students",db_connection)

In [27]:
df

,Name,Email,City,DOB,Salary,address,student_id
0,Anshu,anshu@anshu.com,Delhi,1995-01-12,456789.0,"Delhi, India",1
1,Juan,None,Jakarta,2001-05-18,NaN,None,2
2,Rahul,rahul@bootup.com,Jakarta,2005-05-01,412789.0,"Jakarta, Indonesia",4
3,john,john@bootup.com,KL,None,997789.0,Kualalumpur Malaysia,5
4,Kelly,Kelly@bootup.com,Singapore,1992-05-02,997789.0,"Singapore, Singapore",6
5,Jimmy,Kelly@bootup.com,Singapore,1992-05-02,997789.0,"Singapore, Singapore",1748
6,Jimmy,Kelly@bootup.com,Singapore,1992-05-02,997789.0,"Singapore, Singapore",1749

In [28]:
df = pd.read_csv(r"D:\AI\data\Bank_churn_modelling.csv")
df.shape

(10000, 14)

In [31]:
import sqlalchemy

In [32]:
conn = sqlalchemy.create_engine('mysql+mysqlconnector://root:12345@localhost/bootup')

In [33]:
df.to_sql(con=conn,name="bank_churn",if_exists='replace',index=False)